# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FlexDuct..::..Create Method
FlexDuct Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, ElementId, ElementId, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible duct into the document, using a point array and flexible duct type. |
| Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible duct into the document, using a point array and flexible duct type. |

# See Also
FlexDuct Class
FlexDuct Members
Autodesk.Revit.DB.Mechanical Namespace